# font
otf-firamono-nerd
ttf-fira-code
ttf-maplemono-nf-cn-unhinted
adobe-source-han-sans-cn-fonts
adobe-source-code-pro-fonts
adobe-source-han-serif-cn-fonts
wqy-zenhei
# noto-fonts
# noto-fonts-cjk
# noto-fonts-emoji

axel
ark
fcitx5-im
fcitx5-rime
kitty
uv
zed
oculante
zoxide
ccache
aria2
ghostty
vlc
mpv
btop
rocm-smi-lib
noise-suppression-for-voice
flameshot
fastfetch
jq
kdialog

archlinux-keyring
archlinuxcn-keyring
rime-ice-pinyin-git

# 显卡驱动（AMD）
mesa
lib32-mesa
xf86-video-amdgpu
vulkan-radeon
lib32-vulkan-radeon

steam


shellcheck
golangci-lint

go
rustup
deno
nvm
bun