tap "oven-sh/bun"
tap "rust-mcp-stack/tap"
brew "agent-browser"
brew "aria2"
brew "btop"
brew "fontconfig"
brew "chezmoi"
brew "chsrc"
brew "curl"
brew "php"
brew "composer"
brew "ffmpeg"
brew "fnm"
brew "gh"
brew "go"
brew "gradle"
brew "iperf3"
brew "lua"
brew "make"
brew "maven"
brew "mole"
brew "neovim"
brew "openjdk@17"
brew "ripgrep"
brew "rustup"
brew "sevenzip"
brew "sshpass"
brew "tmux"
brew "tree"
brew "uv"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "rust-mcp-stack/tap/rust-mcp-filesystem"
cask "android-commandlinetools"
cask "android-ndk"
cask "android-platform-tools"
cask "awesun"
cask "cc-switch"
cask "clash-verge-rev"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "macfuse"
cask "macshot"
cask "maczip"
cask "neteasemusic"
cask "qq"
cask "raycast"
cask "telegram-desktop"
cask "tencent-meeting"
cask "termius"
cask "trae-cn"
cask "visual-studio-code"
cask "wechat"
cask "zed"
cask "zen"
vscode "anthropic.claude-code"
vscode "atishay-jain.all-autocomplete"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "dart-code.dart-code"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "drblury.protobuf-vsc"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "edwinhuish.better-comments-next"
vscode "esbenp.prettier-vscode"
vscode "fanaticpythoner.better-todo-tree"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.docker-explorer"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hancel.markdown-image"
vscode "hollowtree.vue-snippets"
vscode "irongeek.vscode-env"
vscode "jebbs.plantuml"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "michelemelluso.gitignore"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "romantomjak.go-template"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xiaoxin-technology.goctl"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
go "golang.org/x/tools/gopls"
uv "graphifyy[all]"
npm "corepack"
npm "typescript-language-server"
